{
    "name": "Bunny Marked Blowjob Events",
    "CardType": "",
    "CardLimit": "0",
    "Description": "",
    "requires": [""],
    "Speakers": [
        {
            "name": "Vanesa",
            "postName": "",
            "SpeakerType": "Monster"
        }
    ],
    "EventText": [
        {
            "NameOfScene": "Marked Blowjob Suggestion",
            "theScene": [
                "SetPostName", " - Bunny Marked Blowjob",
                "Speaks",
                "SwapLineIf", "Random",
                    "Your mark is pulsing so beautifully~ Let me give you a little attention with my mouth~♥",
                    "I can feel the magic in your mark~ It's making me hungry for your cock~♥",
                    "Mmm, I'm feeling a bit peckish~ How about a little snack?~♥",
                    "Let me give you the best blowjob you've ever had~♥",
                    "I want to make you feel amazing with my lips and tongue~♥",
                "EndLoop",
                "Menu",
                    "Let her suck you off",
                    "Turn her down",
                "EndLoop"
            ]
        },
        {
            "NameOfScene": "Turn her down",
            "theScene": [
                "IfFetishLevelEqualOrGreater", "Oral", "50", "MarkedBlowjobResistBlowjob",
                "JumpToScene", "ResistMarkedBlowjob"
            ]
        },
        {
            "NameOfScene": "MarkedBlowjobResistBlowjob",
            "theScene": [
                "Your deep love of blowjobs combined with the mark's influence makes it incredibly difficult to resist her enhanced suggestion, the very thought of her skilled mouth on your cock sending waves of desire through your body.",
                "JumpToScene", "MarkedBlowjobCheck"
            ]
        },
        {
            "NameOfScene": "MarkedBlowjobCheck",
            "theScene": [
                "StatCheck",
                "ChangeStatCheckDifficulty", "IfFetishLevelEqualOrGreater", "Oral", "50", "1",
                "ChangeStatCheckDifficulty", "IfFetishLevelEqualOrGreater", "Oral", "75", "2",
                "ChangeStatCheckDifficulty", "IfFetishLevelEqualOrGreater", "Oral", "100", "2",
                "ChangeStatCheckDifficulty", "IfHasPerk", "Greater Bunny Zodiac Mark", "2",
                "ChangeStatCheckDifficulty", "IfPlayerHasStatusEffect", "Charm", "2",
                "Temptation", "15", "ResistMarkedBlowjob",
                "Fail", "MarkedBlowjobFail"
            ]
        },
        {
            "NameOfScene": "ResistMarkedBlowjob",
            "theScene": [
                "You manage to resist Vanesa's enhanced suggestion despite the mark's influence, though you can feel it pulsing with disappointment.",
                "Speaks",
                "Oh? You're stronger than I expected~ But your mark will make you mine eventually~♥"
            ]
        },
        {
            "NameOfScene": "MarkedBlowjobFail",
            "theScene": [
                "Unable to resist the combination of her enhanced suggestion and the mark's influence, you find yourself nodding in agreement.",
                "Speaks",
                "SwapLineIf", "Random",
                    "Hehe, I saw you trying to resist~ But you couldn't help yourself, could you?~♥",
                    "Mmm, all that struggling for nothing~ You're mine now, my little snack~♥",
                    "Oh? You actually put up a fight? How adorable~ But look where it got you~♥",
                    "Hehe, I felt you trying to resist my suggestion~ But your body knows what it wants~♥",
                "EndLoop",
                "JumpToScene", "BlowjobStart"
            ]
        },
        {
            "NameOfScene": "Let her suck you off",
            "theScene": [
                "You decide to give in to her enhanced suggestion, the mark's influence making her request seem perfectly reasonable.",
                "Speaks",
                "SwapLineIf", "Random",
                    "That's a good boy~ Let me show you what I can do~♥",
                    "Mmm, you're so eager to please~ Let me reward your cooperation~♥",
                    "Hehe, I knew you'd come around~ Now let me give you the attention you deserve~♥",
                    "Perfect~ Such a willing little snack~ Let me show you how good it feels~♥",
                "EndLoop",
                "JumpToScene", "BlowjobStart"
            ]
        },
        {
            "NameOfScene": "BlowjobStart",
            "theScene": [
                "ApplyStance", "Blowjob",
                "Vanesa kneels down before you with a hungry smile, her expression full of anticipation as she gently takes your cock into her mouth, the warm wetness making you gasp with pleasure as she begins her masterful work.",
                "JumpToScene", "RandomBlowjobScene"
            ]
        },
        {
            "NameOfScene": "RandomBlowjobScene",
            "theScene": [
                "JumpToRandomScene",
                    "SloppyBlowjob",
                    "TipSuckBlowjob",
                    "DeepThroatBlowjob",
                    "HeadBobBlowjob",
                "EndLoop"
            ]
        },
        {
            "NameOfScene": "SloppyBlowjob",
            "theScene": [
                "HitPlayerWith", "Bunny's Quick Taste",
                "Vanesa's mouth works your cock with messy, sloppy enthusiasm, her saliva coating your shaft as she makes wet, slurping sounds with every movement, the enhanced sensation making your cock throb and pulse with overwhelming pleasure.",
                "HitPlayerWith", "Bunny's Quick Taste",
                "The combination of her saliva and enhanced skills creates an intoxicating friction that makes you gasp and moan with each touch, your cock growing harder with each wet stroke as you lose yourself in the sloppy pleasure.",
                "IfPlayerOrgasm", "SloppyOrgasm",
                "JumpToScene", "RandomBlowjobTease"
            ]
        },
        {
            "NameOfScene": "TipSuckBlowjob",
            "theScene": [
                "HitPlayerWith", "Bunny's Quick Taste",
                "Vanesa focuses her attention on the sensitive tip of your cock, her lips and tongue working the most sensitive area with expert precision, the enhanced stimulation sending waves of intense pleasure through your shaft.",
                "HitPlayerWith", "Bunny's Quick Taste",
                "Each lick and suck makes you gasp with pleasure as the enhanced sensation builds steadily, your body trembling with anticipation while your cock twitches and throbs from her concentrated attention.",
                "IfPlayerOrgasm", "TipSuckOrgasm",
                "JumpToScene", "RandomBlowjobTease"
            ]
        },
        {
            "NameOfScene": "DeepThroatBlowjob",
            "theScene": [
                "HitPlayerWith", "Bunny's Quick Taste",
                "Vanesa takes your entire cock deep into her throat, her enhanced skills allowing her to swallow you completely as her throat muscles contract around your shaft, creating an incredibly tight and warm sensation.",
                "HitPlayerWith", "Bunny's Quick Taste",
                "The overwhelming tightness and warmth combined with her enhanced techniques makes you moan helplessly, your cock pulsing with pleasure as she milks you with her throat muscles.",
                "IfPlayerOrgasm", "DeepThroatOrgasm",
                "JumpToScene", "RandomBlowjobTease"
            ]
        },
        {
            "NameOfScene": "HeadBobBlowjob",
            "theScene": [
                "HitPlayerWith", "Bunny's Quick Taste",
                "Vanesa bobs her head up and down on your cock with rhythmic precision, her enhanced skills making each movement perfectly timed as she takes you deep and then pulls back, creating a steady rhythm of pleasure.",
                "HitPlayerWith", "Bunny's Quick Taste",
                "You gasp and moan with each perfect movement as the consistent motion and enhanced stimulation build pleasure steadily, your cock growing harder with each stroke of her rhythmic bobbing.",
                "IfPlayerOrgasm", "HeadBobOrgasm",
                "JumpToScene", "RandomBlowjobTease"
            ]
        },
        
        {
            "NameOfScene": "RandomBlowjobTease",
            "theScene": [
                "CallNextSceneJumpThenReturn",
                "JumpToRandomScene",
                    "HungryBjTease",
                    "GiveInBjTease",
                    "SeductiveLookTease",
                    "CheekNuzzleTease",
                "EndLoop",
                "JumpToScene", "TemptationMenu"
            ]
        },
        {
            "NameOfScene": "TemptationMenu",
            "theScene": [
                "Menu",
                    "Let her continue♥",
                    "Push her off your cock",
                "EndLoop"
            ]
        },
        {
            "NameOfScene": "Push her off your cock",
            "theScene": [
                "CallNextSceneJumpThenReturn",
                "IfFetishLevelEqualOrGreater", "Oral", "50", "BlowJobFetishResist",
                "StatCheck",
                "ChangeStatCheckDifficulty", "IfFetishLevelEqualOrGreater", "Oral", "50", "1",
                "ChangeStatCheckDifficulty", "IfFetishLevelEqualOrGreater", "Oral", "75", "2",
                "ChangeStatCheckDifficulty", "IfFetishLevelEqualOrGreater", "Oral", "100", "2",
                "ChangeStatCheckDifficulty", "IfPlayerHasStatusEffect", "Charm", "2",
                "ChangeStatCheckDifficulty", "IfHasPerk", "Greater Bunny Zodiac Mark", "2",
                "Temptation", "15", "Pushher",
                "Fail", "FailedBJPush"
            ]
        },
        {
            "NameOfScene": "BlowJobFetishResist",
            "theScene": [
                "SwapLineIf", "Random",
                    "You desperately try to fight the overwhelming pleasure, your love of blowjobs making it difficult to resist her enhanced sensation.",
                    "Your willpower wars with her lips and tongue, your love of blowjobs making the pleasure almost impossible to resist.",
                    "You struggle against your desires as her mouth feels perfect, your love of blowjobs creating an impossible temptation.",
                "EndLoop"
            ]
        },
        {
            "NameOfScene": "FailedBJPush",
            "theScene": [
                "You find yourself unable to muster the motivation to push her away, the overwhelming pleasure of her lips on your cock causing your arms to lose it's strength.",
                "Speaks",
                "SwapLineIf", "Random",
                    "Mmm, that's it~ Just let me continue~ You know you want this~♥",
                    "Hehe, no pushing me away? Good boy~ Let me keep going~♥",
                    "Oh? You're not resisting? Perfect~ I'll make sure you enjoy every moment~♥",
                    "Mmm, you're being so cooperative~ Let me reward you with more pleasure~♥",
                "EndLoop",
                "JumpToScene", "RandomBlowjobScene"
            ]
        },
        {
            "NameOfScene": "Let her continue♥",
            "theScene": [
                "Vanesa gives you a smug smile as you make no effort to resist, your cock throbbing with anticipation inside her mouth as you contentedly let it become her snack.",
                "JumpToScene", "RandomBlowjobScene"
            ]
        },
        {
            "NameOfScene": "HungryBjTease",
            "theScene": [
                "Speaks",
                "Mmm, I can't wait to taste your cum~ Give me everything you have~♥"
            ]
        },
        {
            "NameOfScene": "GiveInBjTease",
            "theScene": [
                "Speaks",
                "Mmm, just give in to the pleasure~ Give me what I want~♥"
            ]
        },
        {
            "NameOfScene": "SeductiveLookTease",
            "theScene": [
                "Vanesa looks up at you with a seductive gaze, her crimson eyes gleaming with hunger as she continues to taste your cock with her mouth."
            ]
        },
        {
            "NameOfScene": "CheekNuzzleTease",
            "theScene": [
                "With a smug expression, Vanesa nuzzles your cock against the inside of her soft, furry cheek as she works it"
            ]
        },
        {
            "NameOfScene": "SloppyOrgasm",
            "theScene": [
                "PlayerOrgasm", "1",
                "Your cock erupts with a powerful burst as Vanesa hungrily swallows every drop, her mouth working overtime to catch every spurt of your cum as you moan helplessly from the overwhelming pleasure.",
                "Vanesa's eyes gleam with satisfaction as she savors your taste, her tongue eagerly lapping up any stray drops while you gasp and shudder from the intense orgasm.",
                "Her sloppy technique continues even as you climax, her saliva mixing with your cum as she makes sure not a single drop is wasted. The enhanced sensation of her messy mouth makes your orgasm feel even more intense and satisfying. [PlayerOrgasmLine]",
                "EmptySpiritCounter",
                "JumpToScene", "OrgasmEnd"
            ]
        },
        {
            "NameOfScene": "TipSuckOrgasm",
            "theScene": [
                "PlayerOrgasm", "1",
                "Your cock twitches and convulses as you explode into Vanesa's mouth, the concentrated stimulation on your tip making the orgasm incredibly intense as she eagerly sucks every drop from you.",
                "Vanesa moans with pleasure as she tastes your cum, her lips staying locked around your tip as she sucks you like a straw, leaving you trembling from the overwhelming sensation.",
                "The focused attention on your most sensitive area amplifies every pulse of your orgasm, her lips creating a perfect seal around your tip as she milks you completely dry. The enhanced stimulation makes each spurt feel like pure ecstasy. [PlayerOrgasmLine]",
                "EmptySpiritCounter",
                "JumpToScene", "OrgasmEnd"
            ]
        },
        {
            "NameOfScene": "DeepThroatOrgasm",
            "theScene": [
                "PlayerOrgasm", "1",
                "Your cock pulses violently as you cum deep in Vanesa's throat, the tight warmth of her throat muscles milking every drop from you as she swallows your load with hungry enthusiasm.",
                "Vanesa's throat works rhythmically as she drinks down your cum, her eyes rolling back in pleasure as she savors the taste, while you moan and gasp from the incredible tightness.",
                "The deep penetration combined with her throat's natural contractions creates an overwhelming sensation that makes your entire body convulse. Her enhanced skills ensure that every drop is properly swallowed, leaving you completely drained and satisfied. [PlayerOrgasmLine]",
                "EmptySpiritCounter",
                "JumpToScene", "OrgasmEnd"
            ]
        },
        {
            "NameOfScene": "HeadBobOrgasm",
            "theScene": [
                "PlayerOrgasm", "1",
                "Your cock erupts in perfect rhythm with Vanesa's bobbing head, each stroke perfectly timed to catch your cum as she works you through the entire orgasm with masterful precision.",
                "Vanesa's movements become more eager as she tastes your cum, her bobbing intensifying as she tries to get every last drop, leaving you gasping and moaning from the rhythmic pleasure.",
                "The rhythmic motion continues throughout your climax, each bob perfectly synchronized with your pulses as she ensures maximum pleasure and complete collection. Her enhanced timing makes the entire experience feel like a perfectly choreographed dance of pleasure. [PlayerOrgasmLine]",
                "EmptySpiritCounter",
                "JumpToScene", "OrgasmEnd"
            ]
        },
        {
            "NameOfScene": "OrgasmEnd",
            "theScene": [
                "SemenHeal", "25",
                "ApplyStatusEffect", "Bunny's Quick Taste",
                "You feel more than just your balls being drained as Vanesa absorbs your essence, taking 10% of your damage with it. Her body visibly relaxing as she heals [FinalDamage]",
                "ClearStanceFromMonsterAndPlayer", "Blowjob",
                "With a satisfied sigh, Vanesa pulls back from your cock, her lips leaving a glistening trail of saliva as she gracefully rises to her feet, her crimson eyes gleaming with satisfaction.",
                "Speaks",
                "SwapLineIf", "Random",
                    "Mmm, thank you for the delicious meal~ Your cum tastes wonderful~♥",
                    "Hehe, that was a tasty snack~ I hope you have more for me later~♥",
                    "Oh yes~ Your essence is absolutely divine~ I could eat you up~♥",
                    "Mmm, such a satisfying meal~ Your cum is so nourishing~♥",
                "EndLoop"

            ]
        },
        {
            "NameOfScene": "Pushher",
            "theScene": [
                "With a desperate surge of willpower you manage to pull Vanesa off your cock with a pop and push her away from you, breaking free from her oral pleasure as you stumble back.",
                "Speaks",
                "SwapLineIf", "Random",
                    "It would have felt so good to cum in my mouth~♥",
                    "Mmm, my snack is being shy? I was so close to getting my meal~♥",
                    "Hehe, running away? I was just getting started~♥", 
                "EndLoop",
                "ClearStanceFromMonsterAndPlayer", "Blowjob"
            ]
        }
    ]
}
