{
    "name": "Bunny Mark Events",
    "CardType": "Event",
    "CardLimit": "0",
    "Description": "Events related to the bunny zodiac mark",
    "requires": [""],
    "requiresEvent": [
        {
            "NameOfEvent": "",
            "Progress": "",
            "Choice": "",
            "ChoiceNumber": "-1"
        }
    ],
    "Speakers": [
        {
            "name": "Vanesa",
            "postName": "",
            "SpeakerType": "Monster"
        }
    ],
    "EventText": [
        {
            "NameOfScene": "ApplyMarkAfterLoss",
            "theScene": [
                "IfHasPerk", "Greater Bunny Zodiac Mark", "AlreadyFullyMarked",
                "IfHasPerk", "Minor Bunny Zodiac Mark", "UpdateMark",
                "JumpToScene", "ApplyMinorMark"
            ]
        },
        {
            "NameOfScene": "PowerUp Vanesa",
            "theScene": [
                "IfMonsterHasStance", "Breast Smother", "StartingSmothered",
                "IfHasPerk", "Greater Bunny Zodiac Mark", "GiveVanesaSkills",
                "IfHasPerk", "Minor Bunny Zodiac Mark", "GiveVanesaSkills"
            ]
        },
        {
            "NameOfScene": "StartingSmothered",
            "theScene": [
                "ChangeImageLayer", "ImageSetDontCarryOver", "Breast Smother",
                "ChangeImageLayer", "Expression", "Smug"
            ]
        },
        {
            "NameOfScene": "GiveVanesaSkills",
            "theScene": [
                "GiveSkillToMonster", "Bunny's Marked Suggestion",
                "GiveSkillToMonster", "Bunny's Marked Titfuck Suggestion",
                "GiveSkillToMonster", "Bunny's Marked Energy Drain"
            ]
        },
        {
            "NameOfScene": "ApplyMinorMark",
            "theScene": [
                "As your vision begins to blur from the intoxicating afterglow of your encounter with Vanesa, her eyes gleam with predatory hunger as she holds you close. Her soft, fur-covered hands slide down to your bare chest as her touch sends electric tingles through your skin despite your fading consciousness.",
                "Speaks",
                "Mmm, you look absolutely delicious like this ♥. Time to make you mine, little snack ♥",
                "Vanesa begins to pulse with a soft pink glow, the energy radiating from her body like a warm, seductive aura. Her hands trace a small arcane symbol in the air above your heart and you feel your own body responding with your heart racing and your breath quickening.",
                "Speaks",
                "Just relax and let me work my magic ♥. This will feel... interesting ♥",
                "The moment her hands push the glowing symbol into your skin, you gasp sharply as waves of pure pleasure course through your body. Your cock twitches involuntarily as the magic flows into your flesh, the mark glowing with an ethereal light that matches Vanesa's own aura.",
                "Speaks",
                "Oh my, you're getting so excited already ♥. I can feel your heart pounding under my hands ♥",
                "You can't help but moan as the mark settles into place, the magic coursing through your veins like liquid fire, and Vanesa runs her fingers over the fresh mark, her touch making you shudder with renewed arousal.",
                "Speaks",
                "Perfect ♥. You're taking it so well, my little marked pet ♥",
                "She leans down and places a soft kiss on the mark, her lips warm against your skin, and the moment her lips touch the glowing symbol, an overwhelming wave of pleasure crashes through your body.",
                "PlayerOrgasm", "1",
                "You erupt with an intense climax you didn't know you had left in you, your cum shooting across your chest as the mark's energy amplifies every sensation. The magical bond pulses with each spurt, drawing your life force into the mark as Vanesa watches with predatory satisfaction.",
                "EmptySpiritCounter",
                "The combination of the magical bond and your powerful orgasm proves too much for your body to handle. Your vision blurs completely as you feel yourself losing consciousness, the last thing you see being Vanesa's satisfied smile as you pass out from the overwhelming pleasure.",
                "Speaks",
                "See you next time, cutie ♥. I can't wait to see how much stronger this bond becomes ♥",
                "GivePerk", "Minor Bunny Zodiac Mark"
            ]
        },
        {
            "NameOfScene": "UpdateMark",
            "theScene": [
                "As your vision begins to blur from the intoxicating afterglow of another encounter with Vanesa, her eyes gleam with even more predatory hunger as she leans over you. Her soft pink energy pulses in perfect sync with the zodiac mark already glowing on your chest.",
                "Speaks",
                "Mmm, you're even more delicious the second time around ♥. Now let's complete what we started, my little marked pet ♥",
                "She leans in and gives you a deep, passionate kiss on the lips as her hand delicately pulls out the existing arcane mark from your chest, the symbol floating an inch above you and pulsing with renewed energy.",
                "Speaks",
                "Ah♥ You're going to love this even more than before ♥",
                "Her hand begins to add more intricate patterns to the floating mark, each new line sending waves of pure pleasure through your body. Your mind begins to drift to vivid thoughts of the voluptuous bunny riding you with even greater intensity.",
                "Speaks",
                "Mmm, I can feel how much you want this ♥. Your body is practically begging for the completion ♥",
                "With the enhanced mark complete, Vanesa gently pushes it back into your chest, her hands caressing your skin with tender care. The intensified magic flows through your veins, eliciting a deep, satisfied moan from you.",
                "Speaks",
                "Perfect ♥. All done, my little marked pet ♥. You'll be an absolutely perfect meal for me ♥",
                "She places a soft kiss on the completed mark, her lips warm against your skin, and suddenly the enhanced symbol flares with brilliant light, sending shockwaves of pure ecstasy through your entire body.",
                "PlayerOrgasm", "1",
                "The enhanced mark's power explodes through your body as you reach your peak, your cock erupting with powerful spurts that coat your chest in thick streams of cum. The overwhelming pleasure crashes over you like a tidal wave, leaving you completely helpless.",
                "PlayerOrgasm", "1",
                "Each spurt of your orgasm sends waves of energy coursing through your veins, your life force flowing directly into the mark as Vanesa's eyes gleam with triumphant hunger and satisfaction.",
                "EmptySpiritCounter",
                "The overwhelming power of the completed bond combined with your explosive orgasm shatters your consciousness. Your mind fragments under the intense pleasure as you feel yourself slipping away.",
                "Speaks",
                "Mmm, such a perfect little pet~ You're completely mine now♥~",
                "RemovePerkQuietly", "Minor Bunny Zodiac Mark",
                "GivePerk", "Greater Bunny Zodiac Mark"
            ]
        },
        {
            "NameOfScene": "AlreadyFullyMarked",
            "theScene": [
                "As the intense pleasure of your encounter with Vanesa reaches its peak, you feel a deep sense of fulfillment washing over you, your cock still throbbing with satisfaction as you've once again fulfilled your true purpose in life. A contented smile spreads across your face as you bask in the afterglow.",
                "Speaks",
                "Mmm, you were absolutely delicious, my perfect little meal ♥. I can feel how much you enjoyed serving your purpose ♥",
                "Your body feels completely satisfied and content, a warm glow radiating from the completed mark on your chest as Vanesa runs her fingers through your hair with tender affection. Your eyes flutter closed with bliss as you enjoy the compliments.",
                "Speaks",
                "You're such a good boy for me ♥. Always ready to be my personal feast whenever I desire ♥",
                "She leans down and places a gentle kiss on your forehead, her soft lips warm against your skin as she whispers more sweet words of praise. The completed mark pulses softly on your chest, its energy perfectly synchronized with your heartbeat.",
                "Speaks",
                "I can sense your thoughts, you know ♥. How much you love being my prey, how eagerly you'll return for more ♥",
                "Vanesa's eyes gleam with deep satisfaction as she admires her handiwork, the completed bond between you stronger than ever. You can feel the pride she has as she admires her work. Your expression shows pure contentment as you gaze up at her with adoration.",
                "Speaks",
                "Make sure to come back with plenty of energy for me to drain next time, my little marked pet ♥. I'll be waiting for you ♥",
                "With one final caress of your cheek, Vanesa watches as you drift into peaceful unconsciousness, your body completely spent and satisfied from serving her as her perfect marked prey."
            ]
        }
    ]
}