{
  "name": "Bunny Orgasm Events",
  "CardType": "Event",
  "CardLimit": "0",
  "Description": "Events that happen when you orgasm against the bunny zodiac",
  "requires": [""],
  "requiresEvent": [
    {
      "NameOfEvent": "",
      "Progress": "99",
      "Choice": "",
      "ChoiceNumber": "-1"
    }
  ],
  "Speakers": [
    {
      "name": "Vanesa",
      "postName": "",
      "SpeakerType": "Monster"
    }
  ],
  "EventText": [
    {
      "NameOfScene": "RandomSexOrgasm",
      "theScene": [
        "JumpToRandomScene",
            "RapidBounceSexOrgasm",
            "BreastCupSexOrgasm",
            "TeasingEncouragementSexOrgasm",
            "DrinkCumSexOrgasm",
         "EndLoop"
      ]
    },
    {
      "NameOfScene": "RapidBounceSexOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa's eyes gleam with predatory hunger as she begins to rapidly bounce on your cock.",
        "Her tight, wet pussy grips your shaft with each downward stroke, the intense friction and heat making your cock throb with desperate need.",
        "You can feel her inner walls rippling around your length, each bounce driving you deeper into her warm embrace as she increases her pace.",
        "Vanesa's soft, warm body presses against you with each bounce, her breasts jiggling enticingly as she works to push you over the edge.",
        "Speaks",
        "'Come on~♥ Give me all your cum~♥'",
        "Her movements become even more frantic, her pussy clenching around your shaft like a velvet vice as she senses your impending orgasm.",
        "The sensation of her warm, wet pussy rapidly sliding up and down your shaft becomes overwhelming, your mind blanking out with pure pleasure.",
        "Speaks",
        "'That's it~♥ Cum for me~♥'",
        "As your orgasm crashes over you, Vanesa continues her rapid bouncing, milking every drop of cum from your throbbing cock.",
        "Your cock pulses inside her tight pussy, each spurt of hot seed being greedily accepted by her warm, wet walls.",
        "Vanesa moans with satisfaction as she feels your cum filling her, her pussy clenching around your shaft to wring out every last drop. [PlayerOrgasmLine]",
        "Speaks",
        "'Mmm~♥ So much delicious cum~♥'",
        "She slowly grinds against you, savoring the feeling of your seed inside her as she looks down at you with a satisfied, predatory smile.",
        "Speaks",
        "'You're such a good meal~♥'"
      ]
    },
    {
      "NameOfScene": "BreastCupSexOrgasm",
      "theScene": [
        "Sensing your approaching climax, Vanesa slows her movements and leans back, her hands moving to cup and caress her own breasts.",
        "Her tight pussy still grips your cock as she grinds slowly against you, the gentle friction maintaining your arousal while she puts on a show.",
        "You can feel her warm, wet walls pulsing around your shaft as she plays with her breasts, the sight of her self-pleasure driving you wild.",
        "Vanesa's soft, pillowy breasts fill her hands as she kneads and squeezes them, her nipples hardening under her touch.",
        "Speaks",
        "'Like what you see?~♥'",
        "She arches her back, pressing her breasts together and giving you a perfect view as she continues to ride your cock slowly.",
        "The sensation of her warm pussy grinding against your shaft, combined with the arousing display of her breast play, pushes you closer to the edge.",
        "Speaks",
        "'Watch me while I make you cum~♥'",
        "She increases her grinding pace slightly, her pussy gripping your cock more tightly as she continues to fondle her breasts.",
        "Your cock feels like it's being worshipped by her tight, wet pussy as she moves, the pleasure building to an unbearable peak.",
        "Speaks",
        "'Come for me~♥ Fill me with your cum~♥'",
        "As you climax, Vanesa's pussy clenches around your cock, milking your seed as she continues to play with her breasts.",
        "Your hot cum fills her warm, wet pussy as she moans with satisfaction, her body trembling with pleasure from both the orgasm and her breast play. [PlayerOrgasmLine]",
        "Speaks",
        "'Mmm~♥ Your cum feels so good inside me~♥'",
        "Vanesa looks down at you with a satisfied smile, her hands still on her breasts as she enjoys the aftermath of your orgasm.",
        "Speaks",
        "'I hope you enjoyed the show~♥'"
      ]
    },
    {
      "NameOfScene": "TeasingEncouragementSexOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa slows her hip movements to a gentle grind, leaning in close to whisper in your ear.",
        "Her tight, wet pussy still grips your cock as she moves slowly, the gentle friction maintaining your arousal while she teases you.",
        "You can feel her warm breath on your ear as she speaks, her soft body pressed against yours as she continues her slow, deliberate movements.",
        "Speaks",
        "'Mmm~♥ Your cock feels so good inside me~♥'",
        "Her inner walls pulse around your shaft as she whispers, the sensation of her tight pussy combined with her words driving you wild.",
        "Vanesa's soft breasts press against your chest as she leans in closer, her warm, wet pussy grinding against your cock with maddening slowness.",
        "Speaks",
        "'I can feel you getting so hard~♥ You want to cum, don't you?~♥'",
        "She increases the pressure of her grinding, her pussy gripping your cock more tightly as she continues her whispered encouragement.",
        "Your cock throbs inside her tight embrace as she speaks, the combination of her words and the physical sensation overwhelming your senses.",
        "Speaks",
        "'Come for me~♥ Give me all your cum~♥'",
        "As you climax, Vanesa's pussy clenches tightly around your cock, milking your seed as she continues to whisper encouragement.",
        "Your hot cum fills her warm, wet pussy as she moans with satisfaction, her body trembling with pleasure from your orgasm. [PlayerOrgasmLine]",
        "She slowly grinds against you, savoring the feeling of your seed inside her as she continues to whisper sweet nothings in your ear.",
        "Speaks",
        "'Mmm~♥ So much delicious cum~♥'"
      ]
    },
    {
      "NameOfScene": "DrinkCumSexOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa slows her movements and looks down at you with hungry, predatory eyes.",
        "Her tight, wet pussy still grips your cock as she grinds slowly, the gentle friction maintaining your arousal while she prepares for your cum.",
        "You can feel her warm, wet walls pulsing around your shaft with anticipation, as if her pussy itself is hungry for your seed.",
        "Speaks",
        "'I'm so hungry for your cum~♥ Feed me~♥'",
        "She increases the pressure of her grinding, her pussy gripping your cock more tightly as she positions herself to receive your seed.",
        "Vanesa's soft body presses against yours as she moves, her warm pussy creating a perfect seal around your shaft.",
        "Speaks",
        "'I want to feel every drop~♥ Give it all to me~♥'",
        "Her inner walls seem to ripple with hunger around your cock, the sensation of her tight pussy combined with her words driving you wild.",
        "Your cock throbs inside her warm embrace as she continues her slow, deliberate movements, building you toward climax.",
        "Speaks",
        "'I'm ready to drink your cum~♥'",
        "As you climax, Vanesa's pussy clenches around your cock like a hungry mouth, slowly gulping down each spurt of your hot seed.",
        "You can feel her warm, wet walls rippling as she savors your cum, each pulse of your orgasm being greedily accepted by her tight pussy. [PlayerOrgasmLine]",
        "Your cock pulses inside her as she milks every drop, her pussy seeming to drink in your seed with obvious satisfaction.",
        "Speaks",
        "'Mmm~♥ So delicious~♥'",
        "She slowly grinds against you, her pussy continuing to pulse around your shaft as she savors the feeling of your cum inside her.",
        "Vanesa looks down at you with a satisfied, predatory smile, her body trembling with pleasure from consuming your seed.",
        "Speaks",
        "'Thank you for the meal~♥'"
      ]
    },
    {
      "NameOfScene": "RandomBreastSmotherOrgasm",
      "theScene": [
        "JumpToRandomScene",
            "MotherlyCoaxingBreastSmotherOrgasm",
            "TightSqueezeBreastSmotherOrgasm",
            "HypnoticTeaseBreastSmotherOrgasm",
        "EndLoop"
      ]
    },
    {
      "NameOfScene": "MotherlyCoaxingBreastSmotherOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa's expression softens with a gentle, motherly warmth as she cradles your head against her soft breasts.",
        "Her pillowy, warm breasts press gently against your face, their softness and warmth creating a comforting embrace as she begins to coax you toward orgasm.",
        "You can feel her soft, fluffy fur against your skin as she gently nuzzles your head deeper into her chest, her maternal care mixed with seductive intent.",
        "Speaks",
        "'There there, my little one~♥ Just let it all out~♥'",
        "Her soft, warm breasts seem to envelop your face completely, their gentle pressure and comforting warmth making you feel safe and cared for.",
        "Vanesa's gentle rocking motion causes her breasts to softly press and release against your face, the rhythmic movement both soothing and arousing.",
        "Speaks",
        "'That's it~♥ Let this bunny take care of you~♥'",
        "The combination of her motherly care and the soft, warm embrace of her breasts pushes you toward orgasm, her gentle coaxing making you feel completely safe.",
        "Speaks",
        "'Give me all your love~♥'",
        "As you climax, Vanesa's soft breasts press more firmly against your face, her gentle rocking continuing as she comforts you through your orgasm.",
        "Your body trembles with pleasure as she holds you close, her soft, warm embrace providing the perfect comfort for your intense climax. [PlayerOrgasmLine]",
        "She continues to gently rock and coo, her motherly care evident as she helps you through the overwhelming sensations.",
        "Speaks",
        "'There there~♥ I've got you~♥'"
      ]
    },
    {
      "NameOfScene": "TightSqueezeBreastSmotherOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa's eyes gleam with predatory hunger as she prepares to take complete control of your orgasm.",
        "Her soft, warm breasts press against your face with increasing pressure, their pillowy softness becoming more constricting as she positions herself.",
        "You can feel her soft, fluffy fur against your skin as she begins to tighten her embrace, her breasts starting to cut off your air supply.",
        "Speaks",
        "'Oh my~♥ Time to make you mine~♥'",
        "Just as you're about to climax, Vanesa suddenly pulls your head deeper into her chest, her soft breasts completely enveloping your face.",
        "Her pillowy breasts press so tightly against your face that you can barely breathe, the soft, warm pressure becoming overwhelming as you struggle.",
        "Speaks",
        "'Cum for me~♥ Now~♥'",
        "As you climax, Vanesa's soft breasts squeeze even tighter around your face, completely cutting off your air as you struggle to recover from the intense orgasm.",
        "Your body convulses with pleasure while trapped in her soft, warm embrace, the lack of oxygen making the experience even more intense. [PlayerOrgasmLine]",
        "She holds you firmly in place, her soft breasts maintaining their tight grip as you struggle to breathe, her control over you absolute.",
        "Speaks",
        "'Mmm~♥ Such a good little prey~♥'"
      ]
    },
    {
      "NameOfScene": "HypnoticTeaseBreastSmotherOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa's voice takes on a hypnotic quality as she begins to describe every sensation of her breasts against your face.",
        "Her soft, warm breasts press gently against your face, their pillowy softness creating the perfect canvas for her seductive descriptions.",
        "You can feel her soft, fluffy fur against your skin as she begins her hypnotic narration, her voice becoming a soothing, commanding presence.",
        "Speaks",
        "'Feel how soft my breasts are against your face~♥'",
        "Her soft, warm breasts seem to pulse with her words, the gentle pressure and warmth becoming more intense as she continues her hypnotic description.",
        "Vanesa's soft hands gently stroke your hair as she speaks, her voice weaving a spell of pleasure and submission around you.",
        "Speaks",
        "'Feel how warm they are~♥ How they envelop your face~♥'",
        "The combination of her soft, warm embrace and her hypnotic voice pushes you toward the edge of orgasm, her descriptions making every sensation more intense.",
        "Speaks",
        "'Now cum for me~♥'",
        "As you climax, Vanesa's soft breasts press firmly against your face, her hypnotic voice continuing to guide you through the intense orgasm.",
        "Your body trembles with pleasure as her soft, warm embrace holds you close, her words still echoing in your mind. [PlayerOrgasmLine]",
        "She continues to gently rock and speak, her soft breasts providing the perfect comfort as you recover from the overwhelming climax."
      ]
    },
    {
      "NameOfScene": "RandomDefaultOrgasm",
      "theScene": [
        "JumpToRandomScene",
            "StripTeaseDefaultOrgasm",
            "EarTeaseDefaultOrgasm",
            "WhisperTeaseDefaultOrgasm",
        "EndLoop"
      ]
    },
    {
      "NameOfScene": "StripTeaseDefaultOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa steps back with a predatory smile, her eyes gleaming with hunger as she begins a slow, seductive dance.",
        "Her soft, white fur catches the light as she moves, her voluptuous figure swaying hypnotically as she runs her hands along her curves.",
        "You can feel your cock throbbing with desperate need as you watch her, your body trembling with anticipation while she puts on her show.",
        "Vanesa's hands trace along the edges of her tight red latex bunny suit, her fingers teasing at the revealing gaps that expose her soft, fluffy fur.",
        "She arches her back, pressing her massive breasts against the tight material, the latex straining as if it might burst at any moment.",
        "Speaks",
        "'Like what you see, my little prey?~♥'",
        "Her movements become more explicit, her hands caressing her own body as she watches your reaction, her eyes never leaving your face.",
        "You can feel your orgasm building as you watch her, the combination of her seductive dance and your own arousal becoming overwhelming.",
        "Speaks",
        "'Come for me~♥ Watch me while you cum~♥'",
        "As you climax, Vanesa continues her seductive dance, her eyes locked on yours as she watches you experience the intense orgasm.",
        "Your cock pulses with each spurt of cum, the pleasure overwhelming as you watch her soft, warm body move in her hypnotic rhythm. [PlayerOrgasmLine]",
        "She slows her movements, her hands still caressing her body as she savors the sight of your orgasm, her predatory smile growing wider.",
        "Speaks",
        "'Mmm~♥ Such a good little meal~♥'"
      ]
    },
    {
      "NameOfScene": "EarTeaseDefaultOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa's eyes gleam with predatory hunger as she slowly approaches you, her soft, warm body radiating heat.",
        "Her soft, white fur brushes against your skin as she gets closer, the gentle touch of her fluffy coat making your cock throb with anticipation.",
        "You can feel her warm breath on your neck as she leans in close, her soft, pillowy breasts pressing gently against your chest.",
        "Vanesa's soft hands gently cup your face as she positions herself, her warm, wet tongue flicking out to tease your earlobe.",
        "Speaks",
        "'Mmm~♥ Your ears are so sensitive~♥'",
        "She slowly inserts her warm, wet tongue into your ear canal, the intimate sensation making your cock pulse with desperate need.",
        "You can feel her soft, warm body pressed against yours as she continues her ear play, her gentle movements driving you toward the edge of orgasm.",
        "The combination of her soft fur, warm body, and intimate ear play pushes you closer to climax, your cock aching with the need to cum.",
        "Speaks",
        "'Come for me~♥ Let me taste your pleasure~♥'",
        "As you climax, Vanesa continues her ear play, her soft, warm body pressed against yours as she feels your body tremble with orgasm.",
        "Your cock pulses with each spurt of cum, the intense pleasure combined with her intimate ear teasing making the orgasm even more overwhelming. [PlayerOrgasmLine]",
        "She slowly withdraws her tongue from your ear, her soft, warm body still pressed against yours as she savors the feeling of your orgasm.",
        "Speaks",
        "'Mmm~♥ Such a delicious reaction~♥'"
      ]
    },
    {
      "NameOfScene": "WhisperTeaseDefaultOrgasm",
      "theScene": [
        "Sensing you're close to climax, Vanesa approaches you with a predatory grace, her soft, warm body radiating heat as she gets closer.",
        "Her soft, white fur catches the light as she moves, her voluptuous figure swaying seductively as she positions herself right in front of you.",
        "You can feel her warm breath on your face as she leans in close, her soft, pillowy breasts pressing gently against your chest.",
        "Vanesa's soft hands gently rest on your shoulders as she leans in, her warm, wet lips brushing against your ear as she begins to whisper.",
        "Speaks",
        "'Mmm~♥ I can smell how much you want me~♥'",
        "Her soft, warm breath tickles your ear as she whispers, her voice taking on a hypnotic quality that makes your body tremble with arousal.",
        "Speaks",
        "'I'm going to devour you completely~♥ Every inch of you will be mine~♥'",
        "Her soft, warm body presses more firmly against yours as she continues her whispered promises, her gentle movements building your arousal.",
        "The combination of her soft fur, warm body, and whispered promises pushes you closer to climax, your cock aching with the need to be inside her.",
        "Speaks",
        "'Come for me~♥ Give me all your cum~♥'", 
        "As you climax, Vanesa continues her whispered seduction, her soft, warm body pressed against yours as she feels your body convulse with orgasm.",
        "Your cock pulses with each spurt of cum, the intense pleasure combined with her whispered promises making the orgasm even more overwhelming. [PlayerOrgasmLine]",
        "She slowly eases her embrace, her soft, warm body still close to yours as she savors the feeling of your orgasm, her whispered words still echoing in your mind.",
        "Speaks",
        "'Mmm~♥ Such a good little meal~♥'"
      ]
    }
  ]
}
